36 120 260
36 101 261
108 105 262
109 114 263
118 105 264
115 114 265
260 262 266
105 118 267
36 119 268
101 120 269
36 123 270
36 115 271
105 114 272
36 103 273
109 120 274
109 119 275
115 118 276
101 114 277
105 119 278
36 102 279
105 104 280
36 116 281
36 106 282
263 107 283
101 112 284
115 121 285
261 114 286
101 118 287
260 115 288
36 113 289
36 263 290
271 106 291
36 104 292
36 108 293
109 103 294
101 119 295
14 14 296
286 104 297
260 108 298
230 132 299
112 105 300
109 265 301
115 113 302
112 112 303
272 120 304
36 112 305
36 264 306
36 114 307
119 120 308
122 105 309
36 105 310
112 125 311
118 115 312
279 105 313
36 107 314
109 104 315
50 296 316
101 103 317
36 88 318
121 120 319
115 120 320
36 77 321
298 269 322
36 275 323
36 87 324
36 265 325
109 113 326
101 125 327
105 120 328
282 276 329
109 107 330
119 105 331
101 104 332
115 123 333
101 113 334
299 157 335
122 267 336
36 69 337
36 71 338
103 120 339
36 121 340
268 120 341
112 104 342
121 118 343
36 274 344
36 81 345
36 262 346
36 125 347
269 301 348
109 118 349
274 108 350
103 105 351
270 108 352
115 112 353
270 105 354
103 108 355
120 267 356
261 119 357
270 350 358
109 112 359
36 70 360
109 303 361
114 104 362
273 265 363
270 295 364
109 106 365
36 84 366
36 44 367
267 119 368
105 113 369
111 105 370
347 285 371
262 118 372
36 76 373
293 101 374
261 120 375
36 118 376
269 105 377
281 312 378
36 91 379
101 107 380
121 112 381
36 299 382
292 105 383
261 264 384
116 116 385
36 72 386
115 264 387
36 86 388
268 105 389
273 302 390
278 120 391
36 53 392
318 262 393
121 113 394
101 263 395
277 104 396
120 108 397
121 119 398
118 109 399
36 54 400
115 116 401
275 120 402
310 124 403
330 108 404
118 302 405
121 114 406
101 102 407
105 123 408
115 104 409
36 82 410
109 309 411
374 309 412
36 122 413
115 119 414
274 125 415
264 119 416
276 120 417
307 320 418
271 118 419
43 119 420
285 342 421
277 120 422
299 161 423
36 74 424
278 119 425
115 103 426
105 112 427
279 125 428
36 75 429
117 121 430
113 304 431
261 112 432
268 121 433
287 120 434
116 105 435
298 275 436
36 73 437
114 120 438
282 405 439
109 278 440
36 80 441
268 108 442
272 104 443
404 120 444
105 287 445
284 311 446
273 108 447
121 308 448
261 102 449
268 101 450
317 111 451
264 104 452
285 120 453
88 262 454
287 104 455
115 308 456
284 112 457
101 116 458
293 295 459
36 83 460
36 300 461
121 104 462
109 122 463
302 105 464
107 108 465
260 118 466
314 115 467
293 275 468
382 160 469
281 112 470
36 78 471
270 276 472
36 110 473
292 115 474
295 120 475
106 105 476
107 105 477
266 125 478
36 38 479
101 111 480
285 118 481
279 319 482
273 277 483
118 285 484
450 315 485
294 108 486
261 303 487
315 105 488
270 361 489
120 105 490
115 111 491
265 107 492
36 89 493
36 111 494
270 262 495
116 112 496
115 107 497
109 105 498
109 284 499
277 119 500
352 115 501
263 105 502
120 372 503
121 264 504
317 120 505
271 319 506
307 105 507
116 120 508
305 109 509
289 387 510
334 105 511
265 105 512
294 105 513
266 349 514
269 280 515
390 116 516
261 104 517
340 116 518
301 119 519
36 79 520
285 119 521
102 267 522
289 105 523
449 453 524
340 119 525
354 264 526
380 105 527
118 101 528
121 105 529
363 120 530
325 105 531
121 102 532
268 115 533
326 105 534
101 264 535
36 326 536
263 104 537
116 267 538
260 105 539
352 486 540
270 421 541
109 101 542
293 332 543
101 370 544
336 125 545
330 114 546
273 112 547
324 120 548
101 121 549
106 106 550
109 126 551
318 108 552
290 120 553
313 272 554
103 103 555
36 272 556
119 115 557
340 114 558
261 107 559
281 267 560
291 106 561
115 491 562
290 103 563
294 284 564
287 125 565
281 105 566
306 119 567
509 370 568
268 103 569
327 119 570
347 445 571
310 122 572
272 351 573
109 116 574
116 417 575
109 264 576
348 119 577
317 105 578
292 275 579
381 120 580
268 464 581
115 331 582
407 300 583
263 120 584
105 116 585
289 277 586
266 264 587
113 267 588
271 503 589
321 114 590
276 104 591
118 125 592
261 385 593
285 465 594
264 114 595
298 277 596
472 111 597
274 105 598
401 300 599
333 114 600
281 434 601
307 408 602
339 301 603
416 119 604
313 103 605
285 438 606
261 118 607
271 336 608
36 430 609
268 116 610
104 121 611
277 351 612
109 300 613
265 104 614
266 113 615
432 557 616
295 119 617
102 300 618
317 108 619
295 105 620
101 359 621
294 111 622
276 113 623
566 599 624
260 534 625
106 356 626
115 102 627
101 122 628
276 125 629
314 328 630
285 362 631
267 122 632
321 120 633
36 93 634
495 114 635
264 105 636
272 119 637
352 269 638
338 108 639
274 301 640
105 303 641
289 125 642
50 423 643
36 365 644
36 90 645
287 111 646
263 111 647
286 125 648
473 448 649
304 119 650
307 115 651
346 118 652
306 103 653
264 269 654
118 121 655
109 277 656
276 119 657
553 115 658
371 118 659
36 49 660
494 114 661
265 119 662
260 123 663
281 115 664
349 308 665
273 115 666
283 119 667
549 331 668
344 119 669
271 343 670
114 105 671
309 112 672
36 55 673
112 294 674
275 108 675
43 120 676
48 423 677
373 105 678
101 123 679
336 119 680
281 264 681
281 353 682
275 119 683
268 262 684
50 38 685
109 342 686
277 107 687
269 411 688
470 327 689
261 626 690
269 278 691
299 160 692
118 274 693
109 521 694
36 312 695
106 120 696
313 120 697
268 435 698
282 665 699
332 105 700
103 278 701
273 421 702
281 118 703
292 278 704
334 116 705
293 326 706
261 555 707
315 304 708
293 333 709
111 119 710
375 120 711
362 267 712
363 119 713
289 456 714
325 311 715
36 40 716
663 115 717
123 105 718
262 104 719
112 109 720
115 309 721
106 623 722
123 114 723
115 125 724
269 267 725
121 284 726
264 438 727
105 103 728
113 277 729
115 122 730
605 668 731
112 462 732
261 339 733
282 105 734
292 365 735
261 113 736
310 113 737
108 283 738
292 315 739
279 112 740
383 103 741
279 451 742
124 120 743
476 339 744
121 355 745
103 280 746
48 38 747
365 294 748
390 113 749
115 409 750
484 465 751
120 283 752
270 422 753
353 497 754
290 356 755
114 283 756
517 104 757
294 120 758
484 362 759
105 339 760
389 103 761
507 280 762
306 112 763
571 119 764
104 327 765
340 712 766
36 56 767
379 105 768
559 395 769
532 674 770
305 562 771
121 303 772
307 333 773
289 544 774
433 385 775
661 333 776
643 296 777
272 267 778
284 119 779
331 112 780
298 647 781
36 545 782
414 119 783
269 108 784
318 118 785
120 125 786
270 327 787
563 732 788
290 122 789
572 272 790
290 104 791
36 95 792
77 114 793
266 331 794
389 105 795
292 265 796
435 339 797
289 327 798
115 303 799
295 280 800
289 745 801
442 421 802
588 294 803
340 331 804
36 52 805
287 107 806
536 116 807
275 105 808
45 48 809
109 311 810
348 284 811
115 342 812
119 119 813
282 112 814
269 283 815
36 96 816
310 545 817
106 387 818
279 121 819
109 408 820
103 111 821
88 108 822
266 114 823
493 114 824
341 462 825
36 57 826
410 408 827
294 119 828
110 760 829
313 283 830
337 362 831
552 275 832
426 111 833
268 327 834
305 475 835
539 334 836
382 152 837
354 303 838
45 296 839
495 264 840
262 114 841
474 278 842
394 116 843
382 151 844
586 125 845
735 476 846
267 120 847
306 107 848
277 477 849
442 333 850
467 283 851
343 114 852
337 803 853
281 416 854
116 108 855
295 265 856
268 125 857
357 119 858
336 114 859
388 105 860
312 123 861
273 457 862
300 339 863
265 120 864
360 319 865
292 600 866
274 280 867
306 113 868
313 112 869
376 444 870
121 362 871
109 280 872
106 744 873
333 267 874
378 611 875
298 582 876
484 116 877
298 751 878
685 296 879
343 283 880
664 584 881
274 440 882
114 107 883
305 492 884
383 106 885
341 434 886
289 265 887
36 443 888
275 113 889
261 103 890
263 351 891
306 575 892
281 108 893
276 111 894
399 102 895
122 272 896
121 278 897
112 278 898
289 263 899
480 283 900
320 108 901
268 113 902
346 112 903
287 355 904
109 102 905
107 118 906
426 109 907
121 446 908
112 396 909
125 119 910
381 287 911
354 105 912
62 296 913
379 108 914
289 369 915
359 415 916
109 618 917
431 119 918
320 372 919
114 267 920
77 120 921
302 328 922
718 272 923
361 301 924
433 102 925
45 50 926
268 326 927
299 152 928
121 116 929
273 606 930
109 124 931
279 118 932
433 355 933
356 119 934
369 304 935
579 103 936
341 118 937
697 923 938
106 381 939
313 818 940
314 877 941
274 119 942
274 120 943
467 409 944
264 308 945
268 570 946
285 114 947
123 455 948
368 265 949
314 121 950
268 343 951
271 723 952
36 58 953
341 361 954
356 114 955
326 278 956
271 102 957
269 355 958
463 278 959
365 105 960
467 859 961
103 302 962
101 349 963
328 119 964
282 263 965
289 409 966
308 369 967
310 287 968
103 109 969
101 124 970
289 280 971
346 264 972
103 304 973
769 308 974
105 336 975
290 490 976
903 116 977
284 111 978
36 370 979
516 277 980
115 353 981
402 119 982
113 119 983
268 511 984
120 119 985
289 700 986
352 613 987
272 103 988
525 280 989
314 511 990
101 108 991
113 263 992
282 631 993
561 294 994
378 122 995
120 272 996
398 119 997
298 636 998
36 65 999
298 594 1000
50 95 1001
271 116 1002
260 544 1003
109 115 1004
472 342 1005
36 50 1006
121 416 1007
125 283 1008
103 425 1009
123 327 1010
261 319 1011
307 394 1012
351 508 1013
36 304 1014
306 446 1015
314 118 1016
287 119 1017
268 546 1018
290 308 1019
268 267 1020
67 296 1021
91 105 1022
277 111 1023
516 300 1024
305 679 1025
293 404 1026
107 277 1027
107 328 1028
121 312 1029
36 280 1030
273 353 1031
698 103 1032
273 118 1033
306 116 1034
282 537 1035
341 377 1036
112 280 1037
284 105 1038
261 759 1039
461 332 1040
306 332 1041
321 119 1042
403 120 1043
293 396 1044
780 106 1045
912 111 1046
403 538 1047
328 125 1048
775 417 1049
799 333 1050
403 116 1051
268 922 1052
105 106 1053
268 328 1054
122 283 1055
887 397 1056
634 285 1057
288 116 1058
447 287 1059
319 301 1060
281 770 1061
403 496 1062
282 505 1063
376 406 1064
306 284 1065
263 119 1066
262 119 1067
466 500 1068
334 278 1069
116 118 1070
857 967 1071
672 401 1072
318 105 1073
595 351 1074
323 119 1075
269 372 1076
104 267 1077
105 332 1078
393 125 1079
290 119 1080
107 107 1081
268 112 1082
103 265 1083
567 116 1084
324 108 1085
264 332 1086
305 320 1087
551 105 1088
306 430 1089
310 873 1090
480 278 1091
103 115 1092
36 59 1093
101 110 1094
294 446 1095
337 119 1096
288 115 1097
260 267 1098
113 280 1099
36 42 1100
785 843 1101
337 112 1102
961 431 1103
101 452 1104
846 727 1105
36 488 1106
306 120 1107
754 125 1108
269 276 1109
284 397 1110
282 406 1111
324 105 1112
374 385 1113
281 949 1114
112 283 1115
300 287 1116
279 330 1117
292 327 1118
704 546 1119
314 778 1120
363 106 1121
306 300 1122
268 891 1123
337 118 1124
109 680 1125
576 339 1126
122 280 1127
270 302 1128
275 301 1129
101 309 1130
108 574 1131
530 263 1132
279 901 1133
273 276 1134
308 118 1135
97 296 1136
413 320 1137
338 112 1138
109 304 1139
383 1072 1140
282 408 1141
292 328 1142
273 343 1143
281 319 1144
567 580 1145
869 498 1146
282 118 1147
282 359 1148
281 269 1149
289 646 1150
272 331 1151
263 278 1152
551 280 1153
118 294 1154
295 108 1155
314 654 1156
120 265 1157
493 87 1158
441 105 1159
310 112 1160
560 973 1161
102 118 1162
282 334 1163
319 105 1164
337 114 1165
281 783 1166
285 331 1167
268 632 1168
321 106 1169
355 981 1170
357 111 1171
292 880 1172
273 287 1173
287 109 1174
338 302 1175
346 332 1176
609 391 1177
563 264 1178
517 122 1179
273 481 1180
122 820 1181
380 278 1182
279 115 1183
260 391 1184
314 320 1185
273 264 1186
383 116 1187
36 61 1188
422 119 1189
292 369 1190
427 119 1191
424 118 1192
290 106 1193
496 724 1194
109 452 1195
288 342 1196
50 50 1197
282 1050 1198
397 283 1199
120 262 1200
682 274 1201
591 283 1202
36 60 1203
270 287 1204
264 113 1205
273 304 1206
305 960 1207
593 312 1208
109 573 1209
360 112 1210
822 275 1211
273 458 1212
407 311 1213
109 267 1214
298 667 1215
91 108 1216
294 278 1217
312 813 1218
305 425 1219
324 115 1220
260 125 1221
409 125 1222
264 120 1223
324 103 1224
286 919 1225
122 278 1226
276 114 1227
279 391 1228
507 743 1229
295 278 1230
289 444 1231
355 114 1232
1002 272 1233
552 269 1234
536 575 1235
277 103 1236
530 312 1237
112 425 1238
390 105 1239
429 115 1240
114 425 1241
607 120 1242
267 283 1243
366 312 1244
45 63 1245
498 342 1246
114 280 1247
273 456 1248
761 614 1249
424 276 1250
310 619 1251
386 105 1252
109 111 1253
306 331 1254
306 106 1255
115 108 1256
749 406 1257
101 326 1258
414 280 1259
281 874 1260
102 105 1261
287 477 1262
393 264 1263
1052 738 1264
281 399 1265
341 269 1266
101 126 1267
289 395 1268
601 294 1269
943 300 1270
273 262 1271
116 300 1272
341 396 1273
289 328 1274
788 283 1275
980 125 1276
263 284 1277
394 277 1278
377 311 1279
382 156 1280
261 122 1281
76 105 1282
789 391 1283
451 119 1284
289 924 1285
281 327 1286
101 385 1287
70 319 1288
292 1126 1289
697 356 1290
115 320 1291
304 301 1292
121 103 1293
305 426 1294
473 627 1295
122 694 1296
286 114 1297
338 265 1298
443 119 1299
507 336 1300
282 481 1301
292 118 1302
273 620 1303
1029 435 1304
389 369 1305
260 399 1306
902 457 1307
281 456 1308
988 125 1309
363 103 1310
102 368 1311
273 705 1312
395 119 1313
487 333 1314
298 283 1315
321 362 1316
378 618 1317
282 772 1318
293 464 1319
289 269 1320
461 107 1321
273 535 1322
282 287 1323
395 280 1324
293 455 1325
305 402 1326
271 385 1327
602 119 1328
447 686 1329
525 283 1330
112 502 1331
413 284 1332
263 280 1333
1012 522 1334
263 425 1335
819 686 1336
263 101 1337
366 108 1338
275 719 1339
906 334 1340
281 401 1341
118 269 1342
300 107 1343
107 125 1344
512 125 1345
470 277 1346
853 277 1347
264 272 1348
36 94 1349
269 504 1350
123 570 1351
274 284 1352
305 1270 1353
281 414 1354
373 333 1355
358 453 1356
292 402 1357
107 267 1358
305 1262 1359
279 562 1360
378 106 1361
976 945 1362
539 1232 1363
289 730 1364
310 300 1365
682 513 1366
275 280 1367
508 301 1368
1059 317 1369
398 108 1370
314 112 1371
269 101 1372
842 114 1373
268 1170 1374
363 308 1375
739 114 1376
655 339 1377
1094 276 1378
281 617 1379
276 397 1380
1083 302 1381
734 427 1382
260 852 1383
447 849 1384
653 304 1385
43 264 1386
101 274 1387
118 458 1388
268 111 1389
105 452 1390
273 1116 1391
463 283 1392
118 505 1393
560 722 1394
279 312 1395
36 85 1396
105 124 1397
455 119 1398
270 693 1399
279 398 1400
547 1258 1401
349 104 1402
36 43 1403
120 280 1404
313 108 1405
378 1009 1406
847 395 1407
403 797 1408
268 274 1409
121 280 1410
461 672 1411
461 120 1412
262 264 1413
269 120 1414
398 280 1415
270 263 1416
705 300 1417
281 405 1418
123 535 1419
260 978 1420
329 113 1421
389 856 1422
279 264 1423
1235 422 1424
101 550 1425
285 397 1426
461 696 1427
419 1077 1428
470 578 1429
270 725 1430
340 438 1431
345 287 1432
334 101 1433
307 445 1434
875 339 1435
979 585 1436
315 280 1437
315 573 1438
289 1345 1439
378 1340 1440
409 105 1441
497 300 1442
267 114 1443
281 475 1444
337 104 1445
607 107 1446
120 115 1447
108 276 1448
556 594 1449
476 1074 1450
290 722 1451
343 415 1452
569 387 1453
413 488 1454
310 295 1455
447 687 1456
395 283 1457
460 102 1458
338 277 1459
289 721 1460
293 330 1461
49 49 1462
36 278 1463
346 1110 1464
261 349 1465
378 829 1466
824 867 1467
396 119 1468
930 592 1469
862 280 1470
410 115 1471
284 415 1472
109 650 1473
1256 114 1474
268 353 1475
121 107 1476
307 265 1477
432 1351 1478
289 1378 1479
683 301 1480
36 391 1481
109 276 1482
437 1304 1483
260 970 1484
338 662 1485
271 538 1486
461 475 1487
292 399 1488
1086 125 1489
437 124 1490
345 277 1491
1113 272 1492
1143 727 1493
388 585 1494
341 629 1495
119 488 1496
123 894 1497
632 688 1498
270 118 1499
123 274 1500
291 996 1501
639 118 1502
449 300 1503
419 1027 1504
121 452 1505
118 284 1506
281 343 1507
1128 272 1508
119 125 1509
115 124 1510
660 49 1511
317 125 1512
352 125 1513
310 1381 1514
282 636 1515
306 351 1516
261 1010 1517
463 272 1518
426 499 1519
406 105 1520
103 895 1521
103 112 1522
365 872 1523
349 265 1524
310 550 1525
315 278 1526
1125 415 1527
443 283 1528
597 283 1529
275 356 1530
267 729 1531
345 280 1532
273 415 1533
289 448 1534
270 265 1535
308 396 1536
293 401 1537
371 883 1538
338 641 1539
432 1489 1540
345 327 1541
293 402 1542
121 821 1543
305 725 1544
275 283 1545
1431 359 1546
113 456 1547
494 537 1548
284 106 1549
271 342 1550
737 1194 1551
305 502 1552
528 696 1553
102 125 1554
334 119 1555
399 278 1556
268 283 1557
267 284 1558
494 361 1559
733 908 1560
547 617 1561
854 708 1562
69 119 1563
388 278 1564
383 284 1565
282 871 1566
637 411 1567
499 119 1568
413 820 1569
378 116 1570
337 120 1571
107 263 1572
389 336 1573
307 511 1574
430 105 1575
118 348 1576
109 336 1577
101 315 1578
106 276 1579
1240 1442 1580
269 343 1581
458 119 1582
548 377 1583
1163 810 1584
1030 274 1585
109 500 1586
320 120 1587
36 309 1588
101 546 1589
69 87 1590
366 112 1591
568 311 1592
281 320 1593
532 112 1594
282 399 1595
36 126 1596
374 1055 1597
102 119 1598
273 101 1599
324 125 1600
345 84 1601
1573 284 1602
471 1474 1603
472 104 1604
403 1417 1605
460 114 1606
324 262 1607
907 1048 1608
1150 328 1609
338 353 1610
279 274 1611
378 490 1612
70 71 1613
385 280 1614
359 287 1615
287 283 1616
634 894 1617
1177 301 1618
937 492 1619
443 280 1620
36 680 1621
314 861 1622
1254 904 1623
523 277 1624
305 444 1625
539 303 1626
326 377 1627
682 294 1628
413 275 1629
289 359 1630
281 287 1631
289 900 1632
294 300 1633
463 280 1634
1073 334 1635
460 118 1636
301 284 1637
292 1372 1638
36 48 1639
292 570 1640
310 430 1641
378 102 1642
299 151 1643
523 500 1644
548 369 1645
109 446 1646
317 278 1647
292 302 1648
549 465 1649
271 555 1650
1056 119 1651
87 120 1652
881 119 1653
1024 124 1654
495 503 1655
115 584 1656
474 283 1657
572 304 1658
671 125 1659
125 445 1660
112 106 1661
971 542 1662
386 369 1663
282 444 1664
360 105 1665
383 102 1666
293 1278 1667
319 504 1668
345 263 1669
1451 348 1670
307 444 1671
1171 280 1672
1312 1589 1673
595 701 1674
1237 112 1675
454 264 1676
288 491 1677
314 411 1678
1369 356 1679
273 693 1680
272 107 1681
77 106 1682
279 295 1683
611 339 1684
890 1218 1685
310 336 1686
274 372 1687
1400 1335 1688
265 125 1689
433 264 1690
293 812 1691
605 464 1692
369 522 1693
121 550 1694
345 103 1695
123 108 1696
755 114 1697
593 445 1698
112 115 1699
119 265 1700
1166 917 1701
324 116 1702
360 693 1703
122 1524 1704
586 380 1705
336 527 1706
1081 391 1707
434 431 1708
279 272 1709
386 118 1710
816 44 1711
273 511 1712
282 411 1713
1494 770 1714
345 118 1715
369 508 1716
757 640 1717
286 284 1718
1221 116 1719
320 119 1720
276 116 1721
343 125 1722
306 308 1723
260 956 1724
306 856 1725
789 353 1726
1201 564 1727
265 278 1728
289 1091 1729
1454 115 1730
50 48 1731
556 107 1732
419 330 1733
337 385 1734
305 101 1735
854 304 1736
105 122 1737
551 348 1738
114 320 1739
284 278 1740
498 106 1741
363 104 1742
1297 947 1743
432 492 1744
325 351 1745
119 108 1746
284 365 1747
300 125 1748
426 1342 1749
433 1707 1750
43 309 1751
69 362 1752
630 752 1753
36 708 1754
1459 332 1755
299 170 1756
114 125 1757
338 287 1758
274 411 1759
736 492 1760
466 1008 1761
707 606 1762
103 262 1763
314 1069 1764
1317 113 1765
480 272 1766
289 272 1767
416 708 1768
417 406 1769
268 481 1770
1704 431 1771
329 588 1772
279 800 1773
292 512 1774
315 104 1775
282 1668 1776
115 522 1777
536 113 1778
304 499 1779
288 765 1780
886 280 1781
379 841 1782
337 303 1783
103 719 1784
343 119 1785
389 272 1786
276 440 1787
305 333 1788
535 438 1789
733 463 1790
43 113 1791
825 125 1792
555 425 1793
707 1202 1794
113 102 1795
105 102 1796
763 330 1797
45 316 1798
968 311 1799
437 883 1800
466 125 1801
275 265 1802
287 118 1803
1106 101 1804
523 295 1805
407 916 1806
1034 416 1807
358 263 1808
936 997 1809
312 116 1810
338 115 1811
270 304 1812
791 448 1813
1175 113 1814
118 276 1815
308 267 1816
661 600 1817
324 490 1818
703 505 1819
113 522 1820
1146 309 1821
1269 911 1822
320 115 1823
689 368 1824
273 1407 1825
276 342 1826
1461 372 1827
315 267 1828
338 304 1829
1180 331 1830
397 594 1831
581 512 1832
463 315 1833
114 278 1834
101 435 1835
323 114 1836
386 628 1837
394 304 1838
365 106 1839
1107 852 1840
274 519 1841
336 120 1842
109 370 1843
1329 595 1844
413 1174 1845
281 604 1846
389 124 1847
69 86 1848
1075 529 1849
122 304 1850
621 119 1851
410 1380 1852
681 1296 1853
326 394 1854
1281 621 1855
572 1438 1856
1361 425 1857
1018 748 1858
414 116 1859
343 503 1860
1283 330 1861
260 654 1862
1000 120 1863
383 784 1864
360 312 1865
112 334 1866
653 591 1867
771 283 1868
381 348 1869
282 264 1870
360 118 1871
280 1558 1872
609 622 1873
328 1497 1874
761 1452 1875
282 426 1876
429 1531 1877
300 120 1878
1265 122 1879
36 267 1880
1257 415 1881
1111 603 1882
339 276 1883
288 1028 1884
1884 372 1885
1557 300 1886
282 387 1887
109 272 1888
267 115 1889
102 451 1890
390 278 1891
447 115 1892
1011 1448 1893
447 806 1894
260 369 1895
268 1519 1896
109 353 1897
458 267 1898
1642 1213 1899
914 269 1900
432 1547 1901
366 118 1902
413 353 1903
282 330 1904
337 813 1905
74 276 1906
366 1768 1907
458 277 1908
273 319 1909
101 109 1910
121 348 1911
1663 1749 1912
286 120 1913
547 582 1914
300 431 1915
269 959 1916
1502 402 1917
490 743 1918
1525 417 1919
548 691 1920
766 1536 1921
113 269 1922
1145 119 1923
279 1222 1924
648 1199 1925
282 457 1926
93 285 1927
1458 1433 1928
314 272 1929
915 1311 1930
306 496 1931
481 114 1932
109 394 1933
298 654 1934
892 280 1935
442 417 1936
461 287 1937
388 997 1938
380 529 1939
1020 440 1940
824 1527 1941
1509 355 1942
288 120 1943
338 492 1944
277 105 1945
383 112 1946
347 328 1947
969 446 1948
268 488 1949
406 355 1950
103 372 1951
860 107 1952
1160 331 1953
281 1594 1954
293 481 1955
88 80 1956
433 538 1957
101 381 1958
825 440 1959
113 283 1960
1355 975 1961
589 119 1962
735 106 1963
734 269 1964
448 302 1965
125 103 1966
791 1833 1967
112 263 1968
915 629 1969
312 490 1970
314 1518 1971
528 427 1972
834 283 1973
282 578 1974
927 1615 1975
704 1521 1976
265 331 1977
73 86 1978
112 121 1979
460 671 1980
1032 499 1981
528 123 1982
289 302 1983
383 122 1984
294 502 1985
97 95 1986
305 326 1987
289 398 1988
376 1076 1989
1855 583 1990
403 402 1991
1014 576 1992
1149 1473 1993
263 348 1994
284 104 1995
289 537 1996
107 604 1997
282 621 1998
1122 800 1999
590 308 2000
105 284 2001
273 641 2002
378 538 2003
264 123 2004
263 103 2005
559 115 2006
107 115 2007
120 120 2008
274 267 2009
305 407 2010
1294 284 2011
268 304 2012
295 356 2013
319 278 2014
87 87 2015
1858 422 2016
556 1771 2017
445 355 2018
310 863 2019
941 119 2020
279 332 2021
473 115 2022
471 1908 2023
279 924 2024
349 103 2025
36 109 2026
107 280 2027
115 315 2028
314 406 2029
282 576 2030
497 1388 2031
116 287 2032
757 280 2033
337 448 2034
373 1167 2035
334 304 2036
429 118 2037
957 119 2038
1198 283 2039
384 101 2040
282 317 2041
36 39 2042
292 109 2043
115 265 2044
293 1549 2045
116 311 2046
711 451 2047
260 900 2048
277 701 2049
305 806 2050
310 1687 2051
853 101 2052
1205 105 2053
366 353 2054
264 107 2055
349 120 2056
754 564 2057
115 300 2058
406 107 2059
306 611 2060
310 120 2061
121 311 2062
1485 1498 2063
282 628 2064
268 394 2065
385 283 2066
298 1402 2067
264 334 2068
523 328 2069
1500 356 2070
681 120 2071
112 326 2072
1148 113 2073
112 267 2074
394 102 2075
305 396 2076
261 550 2077
413 1897 2078
1216 269 2079
268 631 2080
91 841 2081
364 114 2082
390 102 2083
83 114 2084
1967 726 2085
1032 748 2086
37 296 2087
269 657 2088
262 332 2089
102 562 2090
509 522 2091
1047 1209 2092
289 580 2093
389 1661 2094
305 721 2095
1019 1078 2096
807 312 2097
932 283 2098
106 267 2099
1807 304 2100
1084 1977 2101
118 265 2102
339 519 2103
294 580 2104
293 274 2105
360 287 2106
394 105 2107
273 654 2108
290 274 2109
433 1793 2110
695 300 2111
403 728 2112
533 696 2113
264 112 2114
788 105 2115
341 691 2116
270 1970 2117
285 102 2118
352 598 2119
292 529 2120
268 123 2121
260 806 2122
324 728 2123
627 284 2124
260 1766 2125
104 115 2126
116 312 2127
610 578 2128
379 1826 2129
1944 604 2130
380 280 2131
1147 864 2132
270 958 2133
720 370 2134
780 1226 2135
363 671 2136
281 622 2137
102 457 2138
1024 490 2139
869 333 2140
763 577 2141
125 114 2142
736 606 2143
424 112 2144
287 113 2145
332 278 2146
372 114 2147
390 283 2148
711 1716 2149
753 280 2150
295 283 2151
115 336 2152
429 105 2153
559 264 2154
762 119 2155
1405 537 2156
584 265 2157
105 355 2158
379 361 2159
277 114 2160
604 301 2161
817 1199 2162
376 381 2163
307 811 2164
836 119 2165
116 119 2166
295 111 2167
292 334 2168
324 1426 2169
501 300 2170
497 114 2171
1564 2018 2172
278 105 2173
980 440 2174
306 1181 2175
393 331 2176
1703 675 2177
1747 1227 2178
1542 629 2179
639 1337 2180
992 402 2181
462 105 2182
379 295 2183
115 106 2184
87 115 2185
411 311 2186
273 580 2187
387 104 2188
119 328 2189
601 125 2190
122 284 2191
772 125 2192
707 425 2193
1621 301 2194
260 264 2195
293 456 2196
272 105 2197
289 380 2198
119 123 2199
269 294 2200
1084 662 2201
930 1556 2202
1075 897 2203
302 102 2204
1120 284 2205
289 683 2206
418 738 2207
287 356 2208
338 415 2209
121 331 2210
376 101 2211
282 1872 2212
113 125 2213
703 326 2214
2071 786 2215
386 265 2216
556 103 2217
435 1948 2218
373 275 2219
261 477 2220
591 267 2221
1709 1053 2222
927 2046 2223
720 267 2224
282 1860 2225
450 123 2226
709 975 2227
410 320 2228
306 104 2229
1813 592 2230
444 119 2231
273 401 2232
471 277 2233
1042 1972 2234
569 1139 2235
816 45 2236
471 448 2237
268 931 2238
590 955 2239
268 398 2240
353 1060 2241
505 301 2242
822 269 2243
376 332 2244
115 550 2245
36 230 2246
199 173 2247
1320 356 2248
1963 2104 2249
403 103 2250
267 125 2251
308 105 2252
305 411 2253
1354 640 2254
1168 513 2255
689 267 2256
292 426 2257
741 1129 2258
895 319 2259
1628 125 2260
271 508 2261
121 565 2262
1064 756 2263
413 758 2264
282 1246 2265
466 101 2266
366 434 2267
979 125 2268
853 500 2269
363 122 2270
273 1965 2271
410 811 2272
277 710 2273
689 283 2274
324 1608 2275
119 121 2276
276 283 2277
1140 431 2278
303 283 2279
593 674 2280
893 910 2281
318 115 2282
1423 480 2283
1031 300 2284
281 417 2285
561 513 2286
1128 277 2287
288 948 2288
1394 612 2289
1274 108 2290
349 112 2291
378 120 2292
274 278 2293
101 580 2294
449 119 2295
597 119 2296
365 120 2297
274 283 2298
379 287 2299
115 105 2300
1178 620 2301
365 125 2302
273 2025 2303
289 276 2304
463 284 2305
329 948 2306
506 1496 2307
343 284 2308
113 105 2309
295 662 2310
683 529 2311
1305 119 2312
905 916 2313
827 119 2314
77 87 2315
305 115 2316
695 302 2317
1363 1108 2318
1336 283 2319
313 1572 2320
343 355 2321
466 529 2322
402 294 2323
114 333 2324
755 1181 2325
1595 1299 2326
2031 108 2327
1612 339 2328
487 426 2329
304 311 2330
493 79 2331
466 332 2332
105 550 2333
293 125 2334
1070 359 2335
106 118 2336
325 1331 2337
261 1706 2338
1030 1293 2339
609 598 2340
507 107 2341
341 585 2342
1138 2157 2343
516 328 2344
273 285 2345
530 304 2346
321 113 2347
899 1854 2348
376 275 2349
1743 746 2350
1463 2218 2351
520 387 2352
1456 278 2353
118 283 2354
359 120 2355
530 395 2356
870 119 2357
334 280 2358
437 104 2359
1654 415 2360
740 451 2361
1365 603 2362
706 1045 2363
279 361 2364
337 626 2365
105 105 2366
995 488 2367
377 107 2368
302 113 2369
1122 620 2370
1242 1633 2371
363 1450 2372
337 113 2373
1532 1985 2374
1408 280 2375
376 578 2376
69 104 2377
333 119 2378
1099 109 2379
330 573 2380
272 114 2381
441 407 2382
443 267 2383
1332 529 2384
315 477 2385
341 1425 2386
379 391 2387
943 280 2388
386 585 2389
305 269 2390
449 916 2391
1775 300 2392
338 2178 2393
43 303 2394
36 1136 2395
140 150 2396
287 397 2397
315 327 2398
447 457 2399
427 120 2400
414 283 2401
289 275 2402
337 2335 2403
315 119 2404
1630 274 2405
345 125 2406
317 280 2407
884 267 2408
713 632 2409
289 617 2410
113 274 2411
326 304 2412
655 107 2413
317 719 2414
614 265 2415
1177 519 2416
449 721 2417
273 105 2418
1755 101 2419
530 1393 2420
2252 263 2421
379 350 2422
1266 935 2423
313 1027 2424
114 368 2425
1142 267 2426
749 265 2427
281 1942 2428
850 119 2429
1873 311 2430
1499 492 2431
302 278 2432
264 328 2433
69 112 2434
119 116 2435
413 287 2436
260 274 2437
344 369 2438
289 425 2439
1593 1779 2440
615 2135 2441
331 103 2442
103 283 2443
109 416 2444
548 462 2445
103 1067 2446
370 125 2447
762 280 2448
36 47 2449
555 1202 2450
1089 576 2451
268 598 2452
36 361 2453
345 486 2454
292 463 2455
314 759 2456
1943 284 2457
1090 119 2458
279 109 2459
907 348 2460
121 477 2461
108 1582 2462
403 505 2463
2112 319 2464
344 1045 2465
807 1915 2466
399 280 2467
1726 1127 2468
778 688 2469
429 121 2470
994 1568 2471
116 598 2472
1954 1339 2473
2113 1419 2474
957 829 2475
395 120 2476
289 287 2477
275 103 2478
1733 1277 2479
282 349 2480
1483 277 2481
341 399 2482
388 280 2483
604 280 2484
101 427 2485
607 945 2486
346 434 2487
441 2415 2488
1699 332 2489
292 391 2490
1186 377 2491
1718 910 2492
389 904 2493
763 515 2494
310 116 2495
471 1520 2496
1604 119 2497
282 750 2498
1321 284 2499
359 109 2500
345 904 2501
2064 276 2502
282 931 2503
1295 119 2504
472 397 2505
281 300 2506
109 522 2507
1112 508 2508
341 401 2509
1955 119 2510
480 267 2511
273 1230 2512
966 427 2513
282 1291 2514
72 272 2515
1988 294 2516
273 452 2517
1042 1866 2518
1186 515 2519
2141 1131 2520
1221 435 2521
101 319 2522
483 1739 2523
354 458 2524
305 327 2525
111 125 2526
359 882 2527
517 2181 2528
965 284 2529
1132 529 2530
310 125 2531
269 119 2532
261 462 2533
1180 120 2534
463 359 2535
518 104 2536
825 650 2537
346 342 2538
915 522 2539
273 947 2540
112 120 2541
1193 1979 2542
1770 351 2543
1932 284 2544
605 511 2545
2246 2396 2546
1721 301 2547
305 377 2548
104 272 2549
556 267 2550
817 512 2551
112 675 2552
289 619 2553
597 368 2554
2122 328 2555
373 265 2556
102 115 2557
1269 574 2558
312 611 2559
401 108 2560
324 113 2561
36 92 2562
890 1013 2563
738 1157 2564
286 2199 2565
1983 304 2566
1371 2124 2567
689 280 2568
1492 280 2569
432 1343 2570
1327 1769 2571
269 629 2572
1952 2469 2573
360 427 2574
324 277 2575
324 121 2576
912 710 2577
306 122 2578
293 1167 2579
398 278 2580
460 339 2581
270 1387 2582
305 874 2583
890 430 2584
496 294 2585
101 106 2586
261 603 2587
384 114 2588
43 104 2589
294 312 2590
116 276 2591
270 570 2592
875 603 2593
533 265 2594
1190 265 2595
2183 2564 2596
1537 105 2597
305 456 2598
120 534 2599
1341 911 2600
687 267 2601
118 444 2602
267 103 2603
268 1151 2604
366 287 2605
1732 502 2606
341 105 2607
306 309 2608
740 833 2609
490 105 2610
376 849 2611
36 62 2612
273 1441 2613
454 125 2614
897 765 2615
273 396 2616
2550 1344 2617
785 500 2618
968 2224 2619
273 455 2620
410 105 2621
337 102 2622
299 148 2623
630 119 2624
1837 315 2625
289 320 2626
1396 121 2627
578 2090 2628
366 105 2629
118 327 2630
407 898 2631
1089 391 2632
289 958 2633
337 107 2634
292 272 2635
410 333 2636
119 103 2637
574 300 2638
324 355 2639
103 499 2640
2290 409 2641
353 278 2642
2393 542 2643
286 326 2644
324 969 2645
282 369 2646
69 120 2647
318 2070 2648
345 398 2649
1114 284 2650
476 1674 2651
69 88 2652
1273 455 2653
109 409 2654
1579 351 2655
1098 983 2656
289 315 2657
474 107 2658
341 327 2659
307 348 2660
115 370 2661
67 423 2662
285 618 2663
594 120 2664
1212 120 2665
585 443 2666
1385 311 2667
122 359 2668
976 303 2669
268 1088 2670
287 810 2671
305 1392 2672
2233 2262 2673
275 278 2674
925 829 2675
761 1223 2676
318 2615 2677
261 873 2678
383 332 2679
1879 377 2680
610 304 2681
899 2014 2682
807 505 2683
318 125 2684
386 427 2685
328 108 2686
1717 284 2687
1894 278 2688
321 85 2689
281 452 2690
125 300 2691
107 283 2692
263 283 2693
83 86 2694
819 125 2695
525 267 2696
403 334 2697
121 300 2698
814 115 2699
341 1694 2700
76 333 2701
1842 275 2702
262 112 2703
298 521 2704
698 2158 2705
71 108 2706
597 280 2707
467 284 2708
460 550 2709
848 455 2710
277 746 2711
305 647 2712
429 1348 2713
328 120 2714
748 348 2715
1409 1911 2716
290 110 2717
737 621 2718
606 125 2719
528 126 2720
103 267 2721
282 963 2722
525 368 2723
507 1009 2724
346 628 2725
101 810 2726
971 564 2727
281 772 2728
324 871 2729
346 455 2730
741 112 2731
320 105 2732
951 1070 2733
536 2379 2734
36 51 2735
1377 504 2736
406 120 2737
467 278 2738
293 320 2739
328 267 2740
104 105 2741
1192 2398 2742
713 1828 2743
664 303 2744
273 284 2745
1714 277 2746
1040 368 2747
551 283 2748
399 277 2749
363 1684 2750
69 114 2751
36 128 2752
560 2654 2753
1168 1217 2754
261 116 2755
703 513 2756
111 283 2757
1137 278 2758
260 1091 2759
713 394 2760
1020 694 2761
314 295 2762
376 317 2763
749 274 2764
319 108 2765
102 800 2766
281 527 2767
788 280 2768
328 294 2769
2595 1135 2770
318 90 2771
1031 863 2772
914 598 2773
403 1013 2774
279 287 2775
294 115 2776
552 1785 2777
2405 565 2778
771 119 2779
373 287 2780
1669 1530 2781
270 537 2782
1648 395 2783
751 120 2784
383 585 2785
2153 276 2786
268 417 2787
284 120 2788
509 1162 2789
109 110 2790
846 1074 2791
346 287 2792
102 276 2793
384 295 2794
653 2171 2795
281 1898 2796
345 105 2797
666 303 2798
281 277 2799
273 2535 2800
399 101 2801
1516 1634 2802
522 107 2803
1455 125 2804
125 112 2805
488 452 2806
437 89 2807
314 1130 2808
1383 280 2809
447 612 2810
106 505 2811
501 331 2812
1829 267 2813
666 336 2814
2777 765 2815
109 1575 2816
424 2628 2817
354 1598 2818
627 613 2819
1080 488 2820
1224 2547 2821
376 631 2822
268 272 2823
413 115 2824
324 464 2825
326 1277 2826
361 267 2827
1317 983 2828
1395 332 2829
1271 821 2830
530 505 2831
269 722 2832
324 532 2833
1434 311 2834
311 114 2835
476 452 2836
379 280 2837
1834 765 2838
994 267 2839
279 343 2840
345 614 2841
914 613 2842
77 82 2843
520 283 2844
516 319 2845
115 115 2846
113 646 2847
73 87 2848
306 102 2849
532 105 2850
1481 326 2851
927 1272 2852
338 481 2853
36 64 2854
324 272 2855
547 414 2856
1805 504 2857
69 82 2858
309 125 2859
366 646 2860
2508 1693 2861
295 103 2862
373 334 2863
321 87 2864
2436 694 2865
567 797 2866
2034 1506 2867
713 2806 2868
123 123 2869
388 120 2870
2729 327 2871
846 1674 2872
2616 315 2873
337 106 2874
1414 300 2875
470 500 2876
1084 614 2877
2389 1708 2878
88 118 2879
389 2032 2880
273 300 2881
289 725 2882
1037 477 2883
306 619 2884
102 274 2885
390 431 2886
305 497 2887
379 686 2888
757 604 2889
1435 119 2890
1622 397 2891
125 614 2892
310 588 2893
437 114 2894
274 1164 2895
1208 619 2896
361 119 2897
994 368 2898
2837 2838 2899
466 451 2900
2267 125 2901
2159 109 2902
533 342 2903
292 2413 2904
102 280 2905
376 377 2906
2841 327 2907
83 671 2908
110 724 2909
345 646 2910
273 668 2911
496 278 2912
1964 1007 2913
471 2062 2914
1338 359 2915
893 320 2916
305 451 2917
1011 302 2918
609 2208 2919
351 1820 2920
307 623 2921
307 1874 2922
279 620 2923
105 280 2924
261 124 2925
74 80 2926
332 369 2927
262 120 2928
401 105 2929
547 1627 2930
2017 284 2931
2002 119 2932
628 283 2933
300 122 2934
2463 311 2935
1041 283 2936
437 113 2937
791 294 2938
819 2355 2939
1411 119 2940
413 2056 2941
389 863 2942
666 619 2943
38 48 2944
1183 455 2945
394 650 2946
330 118 2947
108 750 2948
1082 333 2949
648 512 2950
1514 294 2951
1570 414 2952
2339 348 2953
62 51 2954
123 277 2955
334 267 2956
1797 694 2957
1137 368 2958
885 263 2959
279 457 2960
386 115 2961
318 956 2962
687 121 2963
610 320 2964
1401 119 2965
277 125 2966
2669 2380 2967
1493 311 2968
345 265 2969
366 1958 2970
871 452 2971
305 280 2972
2214 565 2973
289 1292 2974
595 107 2975
1248 119 2976
442 1291 2977
303 280 2978
574 119 2979
1289 276 2980
123 1413 2981
1052 956 2982
994 499 2983
109 328 2984
281 498 2985
575 119 2986
2163 278 2987
466 1457 2988
267 592 2989
1966 1115 2990
329 351 2991
270 978 2992
607 399 2993
461 1130 2994
892 119 2995
305 783 2996
450 476 2997
304 1646 2998
442 535 2999
121 427 3000
507 404 3001
378 1997 3002
102 394 3003
108 905 3004
496 327 3005
300 124 3006
1650 343 3007
1265 276 3008
398 301 3009
367 68 3010
270 488 3011
292 2118 3012
83 88 3013
1680 294 3014
1252 2920 3015
442 320 3016
279 462 3017
1322 267 3018
470 2832 3019
114 101 3020
398 283 3021
287 101 3022
281 272 3023
1877 125 3024
893 512 3025
1197 50 3026
2954 51 3027
1697 811 3028
279 2784 3029
106 2192 3030
1976 280 3031
312 723 3032
380 283 3033
1043 2053 3034
2023 2173 3035
1420 283 3036
113 272 3037
579 105 3038
561 267 3039
274 2182 3040
86 105 3041
2454 2485 3042
338 2719 3043
1341 1869 3044
101 343 3045
282 500 3046
337 1476 3047
121 111 3048
359 1343 3049
2239 811 3050
36 336 3051
655 603 3052
383 107 3053
292 1982 3054
281 1789 3055
337 883 3056
287 440 3057
292 330 3058
360 125 3059
2345 1272 3060
1121 349 3061
429 112 3062
608 457 3063
262 308 3064
1479 415 3065
277 101 3066
307 1581 3067
525 908 3068
360 1848 3069
2304 756 3070
491 278 3071
341 2975 3072
560 2462 3073
126 105 3074
366 269 3075
1236 499 3076
1190 396 3077
284 125 3078
2581 1777 3079
1859 1352 3080
87 262 3081
366 456 3082
1289 311 3083
285 104 3084
1913 109 3085
399 508 3086
383 720 3087
102 1222 3088
1281 2028 3089
695 332 3090
858 907 3091
1819 513 3092
569 1209 3093
850 280 3094
429 83 3095
36 45 3096
66 51 3097
260 272 3098
107 391 3099
1040 267 3100
1089 1195 3101
413 542 3102
341 287 3103
328 312 3104
2390 391 3105
36 3049 3106
1044 119 3107
114 600 3108
313 2892 3109
525 278 3110
103 1553 3111
520 105 3112
268 265 3113
321 118 3114
260 284 3115
270 614 3116
398 411 3117
419 104 3118
281 451 3119
281 368 3120
480 368 3121
1797 301 3122
473 462 3123
351 280 3124
1698 119 3125
558 103 3126
302 272 3127
288 353 3128
2492 275 3129
2038 632 3130
293 2971 3131
340 118 3132
89 87 3133
302 295 3134
373 1387 3135
116 319 3136
728 668 3137
579 1287 3138
1041 125 3139
848 911 3140
272 283 3141
905 311 3142
83 82 3143
741 1437 3144
105 278 3145
282 641 3146
1071 119 3147
102 277 3148
1360 119 3149
103 118 3150
306 2310 3151
273 274 3152
401 119 3153
386 277 3154
653 2369 3155
1588 108 3156
458 120 3157
1499 598 3158
274 1060 3159
2097 309 3160
1862 431 3161
401 267 3162
1577 331 3163
753 119 3164
1058 294 3165
437 2397 3166
373 361 3167
1137 105 3168
771 280 3169
302 277 3170
116 414 3171
326 263 3172
1559 280 3173
292 872 3174
2093 2638 3175
315 650 3176
609 105 3177
264 339 3178
268 430 3179
116 349 3180
388 486 3181
299 166 3182
363 680 3183
2565 267 3184
1257 294 3185
377 336 3186
108 812 3187
105 1104 3188
87 71 3189
1254 287 3190
1951 119 3191
103 359 3192
547 532 3193
81 87 3194
1904 504 3195
2704 1468 3196
1012 1311 3197
305 959 3198
390 496 3199
1306 280 3200
788 278 3201
1117 3099 3202
380 265 3203
279 724 3204
272 701 3205
1507 355 3206
381 577 3207
966 1191 3208
109 422 3209
640 284 3210
388 1777 3211
2853 120 3212
345 683 3213
71 112 3214
282 2400 3215
310 444 3216
280 302 3217
1514 125 3218
281 758 3219
1481 407 3220
556 2909 3221
97 50 3222
957 1296 3223
432 955 3224
293 343 3225
925 308 3226
1405 628 3227
360 267 3228
2336 317 3229
380 267 3230
293 265 3231
292 312 3232
713 402 3233
424 1796 3234
2528 1576 3235
703 584 3236
2608 284 3237
261 123 3238
475 294 3239
661 408 3240
345 276 3241
601 119 3242
272 280 3243
1399 996 3244
289 304 3245
1456 280 3246
995 1437 3247
2266 672 3248
781 283 3249
2349 111 3250
321 438 3251
1399 283 3252
2702 935 3253
399 124 3254
1590 1956 3255
2264 326 3256
282 361 3257
553 2559 3258
666 353 3259
113 265 3260
355 498 3261
315 283 3262
572 650 3263
318 264 3264
965 3076 3265
1870 430 3266
1178 2151 3267
1046 443 3268
103 475 3269
2257 1838 3270
263 356 3271
463 415 3272
2232 125 3273
334 283 3274
427 278 3275
338 2990 3276
281 395 3277
91 350 3278
1310 1443 3279
341 655 3280
432 512 3281
1595 443 3282
861 104 3283
389 896 3284
260 285 3285
2553 502 3286
541 114 3287
885 1151 3288
82 115 3289
277 355 3290
115 311 3291
1210 451 3292
1453 119 3293
111 3108 3294
108 334 3295
1266 398 3296
355 849 3297
113 387 3298
858 402 3299
275 372 3300
521 311 3301
758 301 3302
740 497 3303
432 3003 3304
1033 2826 3305
276 1659 3306
963 119 3307
263 446 3308
1152 105 3309
698 280 3310
429 409 3311
318 2311 3312
293 2461 3313
1364 280 3314
2050 267 3315
711 1292 3316
294 1139 3317
50 45 3318
3047 448 3319
1142 621 3320
87 108 3321
325 278 3322
1268 120 3323
268 1608 3324
282 475 3325
1825 311 3326
2000 2895 3327
528 117 3328
1822 311 3329
314 2291 3330
902 434 3331
294 274 3332
331 105 3333
332 115 3334
909 119 3335
276 934 3336
274 355 3337
278 356 3338
721 1820 3339
1912 119 3340
289 919 3341
1374 119 3342
279 396 3343
390 918 3344
437 112 3345
441 679 3346
663 105 3347
2818 598 3348
123 115 3349
107 101 3350
46 46 3351
366 284 3352
2437 300 3353
278 955 3354
1919 119 3355
664 276 3356
868 395 3357
87 464 3358
466 700 3359
886 283 3360
713 1498 3361
126 126 3362
338 864 3363
1649 120 3364
988 440 3365
1016 332 3366
124 326 3367
862 119 3368
267 309 3369
279 1587 3370
129 127 3371
315 101 3372
103 464 3373
120 118 3374
1314 280 3375
112 444 3376
69 626 3377
569 1348 3378
273 3283 3379
560 744 3380
1158 69 3381
1666 377 3382
268 269 3383
1938 656 3384
976 906 3385
36 198 3386
1098 113 3387
494 2404 3388
397 119 3389
84 108 3390
639 3309 3391
329 701 3392
36 124 3393
1132 1410 3394
1705 267 3395
279 277 3396
1861 348 3397
314 1392 3398
305 365 3399
261 3261 3400
88 115 3401
730 280 3402
36 319 3403
2571 415 3404
2495 275 3405
1043 528 3406
666 284 3407
2050 391 3408
1937 114 3409
1316 542 3410
2139 311 3411
951 122 3412
260 443 3413
675 283 3414
530 2259 3415
260 343 3416
1714 500 3417
1082 444 3418
70 105 3419
433 550 3420
69 72 3421
36 315 3422
386 278 3423
1119 280 3424
609 1472 3425
763 688 3426
558 106 3427
345 269 3428
539 743 3429
410 3339 3430
2216 1995 3431
711 1284 3432
353 1164 3433
950 125 3434
80 73 3435
683 519 3436
1216 613 3437
778 284 3438
1302 647 3439
107 278 3440
681 1850 3441
2786 477 3442
559 1309 3443
287 656 3444
81 125 3445
1065 415 3446
321 3328 3447
282 1076 3448
678 264 3449
425 301 3450
1719 278 3451
457 280 3452
2646 1038 3453
366 417 3454
740 750 3455
878 453 3456
104 302 3457
279 2221 3458
279 1023 3459
2464 411 3460
595 355 3461
104 600 3462
338 262 3463
474 303 3464
569 1038 3465
2168 527 3466
292 1553 3467
1742 1841 3468
123 808 3469
804 939 3470
314 959 3471
289 2392 3472
458 108 3473
73 124 3474
1892 513 3475
346 269 3476
1092 263 3477
1212 1352 3478
391 119 3479
1354 1759 3480
2649 2072 3481
263 565 3482
345 1397 3483
107 272 3484
307 1350 3485
1063 657 3486
282 274 3487
270 527 3488
103 125 3489
275 112 3490
734 280 3491
1876 398 3492
331 125 3493
1047 1888 3494
2010 276 3495
2645 573 3496
289 931 3497
410 1874 3498
355 277 3499
270 269 3500
1581 765 3501
300 603 3502
112 402 3503
385 267 3504
798 1261 3505
758 280 3506
287 1004 3507
1059 477 3508
293 276 3509
331 430 3510
289 361 3511
442 600 3512
268 637 3513
307 1069 3514
426 710 3515
2222 942 3516
610 3071 3517
567 481 3518
437 896 3519
377 1344 3520
281 784 3521
121 2811 3522
1865 723 3523
2874 1154 3524
305 2963 3525
260 481 3526
50 839 3527
1938 542 3528
292 2601 3529
324 123 3530
340 362 3531
103 381 3532
102 1510 3533
473 2544 3534
1591 327 3535
366 267 3536
2187 504 3537
432 1831 3538
418 105 3539
1542 276 3540
317 1067 3541
388 728 3542
84 118 3543
314 512 3544
791 2666 3545
290 114 3546
1853 311 3547
721 452 3548
1734 300 3549
1460 431 3550
681 116 3551
276 356 3552
77 119 3553
1224 1587 3554
866 2489 3555
1369 934 3556
1362 283 3557
2003 786 3558
338 947 3559
111 278 3560
453 2147 3561
403 2603 3562
2069 283 3563
341 387 3564
307 2358 3565
324 1956 3566
293 3080 3567
424 665 3568
1912 294 3569
627 1554 3570
1098 1815 3571
268 114 3572
1847 726 3573
118 475 3574
1998 280 3575
109 435 3576
341 264 3577
3017 1028 3578
645 284 3579
1887 546 3580
1173 592 3581
263 114 3582
2699 276 3583
360 1370 3584
289 343 3585
437 475 3586
288 723 3587
373 267 3588
2154 935 3589
273 882 3590
3152 551 3591
1364 498 3592
1463 103 3593
36 425 3594
1562 499 3595
1002 263 3596
1040 283 3597
655 565 3598
268 492 3599
416 108 3600
1025 119 3601
382 170 3602
77 113 3603
1987 867 3604
1033 534 3605
106 1246 3606
1068 2099 3607
610 1528 3608
518 265 3609
417 2147 3610
741 2146 3611
107 759 3612
797 119 3613
641 125 3614
523 3499 3615
1162 2385 3616
62 62 3617
396 368 3618
466 448 3619
282 445 3620
3234 3598 3621
607 355 3622
965 446 3623
447 1741 3624
1318 125 3625
306 1135 3626
410 276 3627
354 444 3628
966 1443 3629
345 1017 3630
720 280 3631
305 2009 3632
306 2414 3633
274 276 3634
1073 124 3635
714 311 3636
516 287 3637
369 650 3638
1664 283 3639
302 283 3640
1184 119 3641
2409 1916 3642
308 265 3643
268 300 3644
593 3188 3645
505 519 3646
1418 320 3647
294 898 3648
273 125 3649
2065 588 3650
1159 1939 3651
410 730 3652
302 116 3653
69 75 3654
1718 125 3655
281 646 3656
2281 564 3657
265 302 3658
3067 284 3659
552 3134 3660
637 301 3661
273 1218 3662
1696 613 3663
489 283 3664
73 82 3665
106 417 3666
354 102 3667
1905 2460 3668
855 109 3669
1742 640 3670
848 301 3671
374 896 3672
352 3186 3673
2734 1279 3674
1599 1415 3675
69 71 3676
2085 119 3677
2823 1482 3678
376 1023 3679
111 272 3680
1134 2114 3681
360 1613 3682
363 1013 3683
311 283 3684
702 114 3685
698 480 3686
1391 311 3687
2524 662 3688
1316 656 3689
1895 538 3690
36 66 3691
362 457 3692
1695 71 3693
324 3501 3694
681 103 3695
2217 481 3696
1624 283 3697
2109 499 3698
776 119 3699
345 387 3700
306 896 3701
302 119 3702
37 37 3703
87 490 3704
493 82 3705
2288 119 3706
3053 636 3707
1629 274 3708
1178 800 3709
337 339 3710
1198 280 3711
337 319 3712
89 114 3713
1183 124 3714
74 71 3715
305 582 3716
2438 119 3717
45 62 3718
2789 565 3719
123 315 3720
569 2197 3721
1075 1410 3722
2902 1555 3723
272 477 3724
536 527 3725
102 112 3726
341 115 3727
414 108 3728
332 104 3729
833 280 3730
977 280 3731
106 591 3732
80 87 3733
406 111 3734
113 621 3735
341 515 3736
598 311 3737
50 335 3738
393 114 3739
442 1835 3740
1035 283 3741
376 453 3742
2008 116 3743
317 283 3744
1025 125 3745
3106 284 3746
282 613 3747
264 284 3748
318 343 3749
268 718 3750
868 1693 3751
517 113 3752
950 910 3753
386 327 3754
268 284 3755
106 578 3756
466 1425 3757
1106 1108 3758
292 377 3759
890 2927 3760
2320 756 3761
1846 504 3762
450 106 3763
1165 114 3764
1106 295 3765
36 68 3766
517 580 3767
317 372 3768
2280 348 3769
2561 350 3770
113 101 3771
437 3255 3772
2078 573 3773
69 303 3774
2517 274 3775
304 280 3776
349 283 3777
271 1368 3778
1233 280 3779
2352 101 3780
556 119 3781
113 116 3782
2418 300 3783
273 2368 3784
1208 3367 3785
293 521 3786
899 276 3787
1991 283 3788
1113 125 3789
470 1647 3790
424 631 3791
38 316 3792
1201 828 3793
2284 477 3794
284 109 3795
1042 909 3796
2557 455 3797
1026 311 3798
1462 1462 3799
3135 109 3800
113 614 3801
1946 327 3802
516 1104 3803
332 283 3804
276 710 3805
2295 3433 3806
268 302 3807
893 1823 3808
418 280 3809
2486 280 3810
868 1313 3811
321 77 3812
859 431 3813
303 276 3814
69 81 3815
110 448 3816
314 458 3817
72 278 3818
1658 908 3819
107 276 3820
345 434 3821
1504 1738 3822
2439 527 3823
261 2089 3824
276 3372 3825
2399 1681 3826
36 546 3827
471 1069 3828
270 960 3829
1628 440 3830
642 1045 3831
366 317 3832
593 1789 3833
2570 280 3834
1770 701 3835
1111 2103 3836
3763 1048 3837
101 350 3838
1120 446 3839
470 422 3840
349 397 3841
825 304 3842
2382 481 3843
494 622 3844
711 1393 3845
460 343 3846
875 746 3847
263 115 3848
1179 422 3849
1455 810 3850
306 435 3851
320 1067 3852
386 275 3853
1622 283 3854
269 356 3855
1047 2412 3856
1516 411 3857
289 2819 3858
345 409 3859
1446 1838 3860
2240 116 3861
1461 3064 3862
107 287 3863
1132 121 3864
107 1066 3865
1062 395 3866
3635 295 3867
1194 431 3868
1140 280 3869
422 294 3870
1271 113 3871
116 107 3872
2881 277 3873
2341 688 3874
586 3522 3875
523 422 3876
775 1259 3877
376 535 3878
260 583 3879
569 272 3880
1870 3217 3881
2271 368 3882
281 1578 3883
293 302 3884
116 272 3885
80 105 3886
1012 267 3887
116 527 3888
324 435 3889
71 265 3890
2480 113 3891
409 440 3892
925 119 3893
424 3461 3894
1058 828 3895
96 51 3896
1986 1986 3897
2144 3825 3898
261 326 3899
2531 278 3900
1488 309 3901
548 2433 3902
105 111 3903
265 650 3904
305 294 3905
345 343 3906
123 488 3907
3190 3191 3908
410 2926 3909
631 119 3910
116 582 3911
282 502 3912
2334 116 3913
628 278 3914
1551 431 3915
1876 1415 3916
1142 1851 3917
3155 443 3918
118 758 3919
380 114 3920
94 1889 3921
1364 283 3922
273 475 3923
287 103 3924
610 443 3925
2540 356 3926
341 527 3927
275 519 3928
1187 1708 3929
1735 1950 3930
307 328 3931
861 119 3932
72 265 3933
429 654 3934
324 632 3935
1566 283 3936
776 2883 3937
1132 897 3938
324 1170 3939
118 119 3940
409 278 3941
265 304 3942
1412 356 3943
2108 283 3944
1321 3490 3945
303 267 3946
283 311 3947
734 1350 3948
2377 3253 3949
308 512 3950
86 86 3951
1310 267 3952
2824 513 3953
289 402 3954
474 276 3955
1551 3145 3956
102 265 3957
345 2827 3958
3072 397 3959
1902 534 3960
548 287 3961
114 115 3962
1062 1324 3963
263 121 3964
1054 120 3965
399 1053 3966
695 102 3967
1255 863 3968
553 118 3969
109 108 3970
2799 427 3971
360 115 3972
430 267 3973
126 267 3974
69 84 3975
271 359 3976
559 636 3977
1298 2651 3978
281 2015 3979
1486 577 3980
888 280 3981
1011 115 3982
422 311 3983
293 394 3984
1171 283 3985
1750 119 3986
1260 939 3987
2576 538 3988
679 114 3989
681 113 3990
557 696 3991
80 69 3992
1600 2801 3993
579 113 3994
1696 486 3995
122 422 3996
3055 119 3997
69 2450 3998
379 641 3999
932 395 4000
124 726 4001
2684 3692 4002
324 267 4003
306 114 4004
87 84 4005
2685 3669 4006
352 302 4007
937 3520 4008
380 115 4009
704 2472 4010
1206 1722 4011
1800 2552 4012
381 377 4013
268 359 4014
388 125 4015
2261 519 4016
396 302 4017
337 2450 4018
290 744 4019
3034 311 4020
396 267 4021
442 1104 4022
390 588 4023
536 380 4024
1379 280 4025
517 401 4026
1800 909 4027
2867 542 4028
418 513 4029
1630 278 4030
125 113 4031
1389 2897 4032
109 123 4033
273 847 4034
1929 2769 4035
2915 574 4036
292 269 4037
309 264 4038
645 267 4039
260 2167 4040
2873 377 4041
3418 311 4042
539 2934 4043
340 2541 4044
305 1152 4045
112 276 4046
429 750 4047
561 1567 4048
318 276 4049
2442 319 4050
1146 106 4051
300 620 4052
558 2816 4053
480 280 4054
461 1939 4055
260 451 4056
563 708 4057
454 331 4058
337 438 4059
360 361 4060
353 294 4061
320 109 4062
333 368 4063
345 456 4064
1062 277 4065
2235 982 4066
270 686 4067
121 370 4068
1362 280 4069
406 1757 4070
1800 502 4071
47 47 4072
1755 656 4073
109 427 4074
1814 1480 4075
3012 120 4076
2542 573 4077
333 438 4078
1121 674 4079
1031 276 4080
294 280 4081
1314 119 4082
2022 263 4083
1020 309 4084
1570 1259 4085
610 1086 4086
314 395 4087
1893 882 4088
2725 125 4089
314 528 4090
121 686 4091
437 545 4092
2061 103 4093
341 1787 4094
1455 1214 4095
447 2321 4096
450 309 4097
1206 267 4098
345 317 4099
109 1048 4100
786 435 4101
36 127 4102
341 104 4103
2947 1189 4104
